Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
emaVersion        = 39
              + tags                 = [
                  + "velero",
                ]
              + templating           = {
                  + list = [
                      + {
                          + current     = {
                              + selected = false
                              + text     = "grafanacloud-dfdsdemo-prom"
                              + value    = "grafanacloud-prom"
                            }
                          + hide        = 0
                          + includeAll  = false
                          + label       = "Datasource"
                          + multi       = false
                          + name        = "datasource"
                          + options     = []
                          + query       = "prometheus"
                          + queryValue  = ""
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + type        = "datasource"
                        },
                      + {
                          + current        = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource     = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition     = "label_values(velero_backup_attempt_total, schedule)"
                          + hide           = 0
                          + includeAll     = true
                          + multi          = true
                          + name           = "schedule"
                          + options        = []
                          + query          = {
                              + query = "label_values(velero_backup_attempt_total, schedule)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh        = 1
                          + regex          = ""
                          + skipUrlSync    = false
                          + sort           = 0
                          + tagValuesQuery = ""
                          + tagsQuery      = ""
                          + type           = "query"
                          + useTags        = false
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(velero_csi_snapshot_attempt_total, backupName)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "csi_backup_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(velero_csi_snapshot_attempt_total, backupName)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(restic_pod_volume_backup_enqueue_count, node)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "restic_node"
                          + options     = []
                          + query       = {
                              + query = "label_values(restic_pod_volume_backup_enqueue_count, node)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(restic_restic_operation_latency_seconds_gauge, backupName)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "restic_backup_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(restic_restic_operation_latency_seconds_gauge, backupName)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(restic_restic_operation_latency_seconds_gauge, operation)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "restic_operation"
                          + options     = []
                          + query       = {
                              + query = "label_values(restic_restic_operation_latency_seconds_gauge, operation)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(restic_restic_operation_latency_seconds_gauge, pod_volume_backup)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "restic_pvb_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(restic_restic_operation_latency_seconds_gauge, pod_volume_backup)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + definition  = "label_values(podVolume_pod_volume_backup_enqueue_count, node)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "fsb_node"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_backup_enqueue_count, node)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + definition  = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, backupName)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "fsb_backup_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, backupName)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + definition  = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, operation)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "fsb_operation"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, operation)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + definition  = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, pod_volume_backup)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "fsb_pvb_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, pod_volume_backup)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                    ]
                }
              + time                 = {
                  + from = "now-2d"
                  + to   = "now"
                }
              + timepicker           = {
                  + hidden            = false
                  + refresh_intervals = [
                      + "5s",
                      + "10s",
                      + "30s",
                      + "1m",
                      + "5m",
                      + "15m",
                      + "30m",
                      + "1h",
                      + "2h",
                      + "1d",
                    ]
                }
              + timezone             = ""
              + title                = "Kubernetes/Tanzu/Velero"
              + uid                  = "YAniUGC"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + overwrite    = true
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/1password-metrics.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/1password-scimbridge.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/aws-backup-metrics.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/aws-cni-metrics.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/aws-subnet-usage.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/blueprints-rds-adoption.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/cloud-engineering-adoption.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/cluster-capacity.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/cluster-health.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/ec2-credits.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/eks-version.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/flux-cluster-stats.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/flux-control-plane.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/goldpinger.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/helm-exporter.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/kafka-exporter.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/kiosk.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/kubernetes-components.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/liveness-readiness-for-namespace.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/liveness-readiness.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/node-condition.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/node-sockets-used.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/priorityclass.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/prometheus-blackbox-exporter.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/selfservice-adoption.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/selfservice-rds-tagging-compliance.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/traefik-blue-green.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/traefik-integration.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/velero.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:ddp232mqi6pdsb" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::616912401663:role/1password_grafana_cloud_athena"
              - authType       = "grafana_assume_role"
              - catalog        = "AwsDataCatalog"
              - database       = "1password"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://dfds-1password-collected-metrics-store/athena"
              - workgroup      = "primary"
            }
        ) -> null
      - name               = "Athena-1Password" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "ddp232mqi6pdsb" -> null
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:ddor6qshlvgu8d" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::080206698049:role/aws-backup-dashboards_grafana_cloud_athena"
              - authType       = "grafana_assume_role"
              - catalog        = "AwsDataCatalog"
              - database       = "awsbackupobservability"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://aws-backup-dashboards/athena"
              - workgroup      = "primary"
            }
        ) -> null
      - name               = "Athena-AWS-Backup" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "ddor6qshlvgu8d" -> null
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:edrbwxzugq7eob" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::303242044692:role/grafana-cloud-observability"
              - authType       = "grafana_assume_role"
              - catalog        = "iam-rolesanywhere-pca-observability"
              - database       = "iam_rolesanywhere_pca_observability"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://dfds-iam-rolesanywhere-pca-observability-athena"
              - workgroup      = "iam-rolesanywhere-pca-observability"
            }
        ) -> null
      - name               = "Athena-IAM-roles-anywhere" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "edrbwxzugq7eob" -> null
    }

  # module.grafana_data_source_aws_athena[0].grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::616912401663:role/1password_grafana_cloud_athena"
              + authType       = "grafana_assume_role"
              + catalog        = "AwsDataCatalog"
              + database       = "1password"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://dfds-1password-collected-metrics-store/athena"
              + workgroup      = "primary"
            }
        )
      + name               = "Athena-1Password"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_athena[0].grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::080206698049:role/aws-backup-dashboards_grafana_cloud_athena"
              + authType       = "grafana_assume_role"
              + catalog        = "AwsDataCatalog"
              + database       = "awsbackupobservability"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://aws-backup-dashboards/athena"
              + workgroup      = "primary"
            }
        )
      + name               = "Athena-AWS-Backup"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_athena[0].grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::303242044692:role/grafana-cloud-observability"
              + authType       = "grafana_assume_role"
              + catalog        = "iam-rolesanywhere-pca-observability"
              + database       = "iam_rolesanywhere_pca_observability"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://dfds-iam-rolesanywhere-pca-observability-athena"
              + workgroup      = "iam-rolesanywhere-pca-observability"
            }
        )
      + name               = "Athena-IAM-roles-anywhere"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:edrtfydh1oagwb" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::563532571036:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-central-1"
            }
        ) -> null
      - name               = "CloudWatch-iam-roles-anywhere-pca-prod-eu-central-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "edrtfydh1oagwb" -> null
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:adrtfydetni0wb" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::381922248812:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-central-1"
            }
        ) -> null
      - name               = "CloudWatch-iam-roles-anywhere-pca-test-eu-central-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "adrtfydetni0wb" -> null
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:edp232mk1y58gc" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::738063116313:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-west-1"
            }
        ) -> null
      - name               = "CloudWatch-oxygen-eu-west-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "edp232mk1y58gc" -> null
    }

  # module.grafana_data_source_aws_cloudwatch[0].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::563532571036:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "CloudWatch-iam-roles-anywhere-pca-prod-eu-central-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch[0].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::381922248812:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "CloudWatch-iam-roles-anywhere-pca-test-eu-central-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch[0].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::738063116313:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-west-1"
            }
        )
      + name               = "CloudWatch-oxygen-eu-west-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_notification.grafana_contact_point.this[0] will be destroyed
  # (because module.grafana_notification is not in configuration)
  - resource "grafana_contact_point" "this" {
      - disable_provenance = false -> null
      - id                 = "0:Cloud Engineering Slack" -> null
      - name               = "Cloud Engineering Slack" -> null
      - org_id             = "0" -> null

      - slack {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.grafana_notification.grafana_notification_policy.this[0] will be destroyed
  # (because module.grafana_notification is not in configuration)
  - resource "grafana_notification_policy" "this" {
      - contact_point      = "grafana-default-email" -> null
      - disable_provenance = true -> null
      - group_by           = [
          - "...",
        ] -> null
      - group_interval     = "5m" -> null
      - group_wait         = "30s" -> null
      - id                 = "0:policy" -> null
      - org_id             = "0" -> null
      - repeat_interval    = "4h" -> null

      - policy {
          - contact_point = "Cloud Engineering Slack" -> null
          - continue      = false -> null
          - group_by      = [
              - "grafana_folder",
            ] -> null
          - mute_timings  = [] -> null

          - matcher {
              - label = "grafana_folder" -> null
              - match = "=" -> null
              - value = "Cloud Engineering" -> null
            }

          - policy {
              - continue        = false -> null
              - group_by        = [
                  - "grafana_folder",
                  - "alertname",
                ] -> null
              - mute_timings    = [] -> null
              - repeat_interval = "1d" -> null

              - matcher {
                  - label = "repeat" -> null
                  - match = "=" -> null
                  - value = "24h" -> null
                }
            }
        }
    }

  # module.grafana_notification[0].grafana_contact_point.this[0] will be created
  + resource "grafana_contact_point" "this" {
      + disable_provenance = false
      + id                 = (known after apply)
      + name               = "Cloud Engineering Slack"

      + slack {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.grafana_notification[0].grafana_notification_policy.this[0] will be created
  + resource "grafana_notification_policy" "this" {
      + contact_point      = "grafana-default-email"
      + disable_provenance = true
      + group_by           = [
          + "...",
        ]
      + group_interval     = "5m"
      + group_wait         = "30s"
      + id                 = (known after apply)
      + repeat_interval    = "4h"

      + policy {
          + contact_point = "Cloud Engineering Slack"
          + group_by      = [
              + "grafana_folder",
            ]

          + matcher {
              + label = "grafana_folder"
              + match = "="
              + value = "Cloud Engineering"
            }

          + policy {
              + group_by        = [
                  + "grafana_folder",
                  + "alertname",
                ]
              + repeat_interval = "24h"

              + matcher {
                  + label = "repeat"
                  + match = "="
                  + value = "24h"
                }
            }
        }
    }

Plan: 98 to add, 0 to change, 100 to destroy.

Changes to Outputs:
  ~ dashboard_meta = [
      ~ {
          ~ uid     = "1password_metrics_adoption" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/1password_metrics_adoption/1password-adoption" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "scimbridge_prod" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/scimbridge_prod/scimbridge-deployment-prod" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "aws_backup_metrics" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/aws_backup_metrics/aws-backup-metrics" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "aws-cni-metrics" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/aws-cni-metrics/aws-cni-metrics" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "1NxY8ypGk" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/1NxY8ypGk/aws-subnet-usage" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "a9c79f60-fdde-4e66-9009-b3863c3e0eda" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/a9c79f60-fdde-4e66-9009-b3863c3e0eda/blueprints-rds-adoption" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "axdphXDZz" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/axdphXDZz/cloud-engineering-adoption" -> (known after apply)
          ~ version = 2 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "s_zMzas4z" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/s_zMzas4z/cluster-capacity" -> (known after apply)
          ~ version = 2 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "4IxKHWtMz" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/4IxKHWtMz/cluster-health" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "GUakfOpMk" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/GUakfOpMk/ec2-credits" -> (known after apply)
          ~ version = 3 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "YMBzktpGzs" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/YMBzktpGzs/eks-version" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "flux-cluster" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/flux-cluster/flux-cluster-stats" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "flux-control-plane" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/flux-control-plane/flux-control-plane" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "D4EyPQTWk" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/D4EyPQTWk/goldpinger" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "Gqncyvfmz" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/Gqncyvfmz/helm-exporter" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ title   = "IAM Roles Anywhere certificates" -> "Kafka-exporter"
          ~ uid     = "fdstr5eh7r5kwa" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/fdstr5eh7r5kwa/iam-roles-anywhere-certificates" -> (known after apply)
          ~ version = 16 -> (known after apply)
        },
      ~ {
          ~ title   = "Kafka-exporter" -> "Kiosk"
          ~ uid     = "CoYn_3-nk" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/CoYn_3-nk/kafka-exporter" -> (known after apply)
          ~ version = 1 -> (known after apply)
        },
      ~ {
          ~ title   = "Kiosk" -> "Kubernetes Components"
          ~ uid     = "b8e019c1-27b7-4e4b-b880-28da9911f046" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/b8e019c1-27b7-4e4b-b880-28da9911f046/kiosk" -> (known after apply)
          ~ version = 1 -> (known after apply)
        },
      ~ {
          ~ title   = "Kubernetes Components" -> "readiness / liveness probes in namespace"
          ~ uid     = "bj5-ZEhWk" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/bj5-ZEhWk/kubernetes-components" -> (known after apply)
          ~ version = 1 -> (known after apply)
        },
      ~ {
          ~ title   = "readiness / liveness probes in namespace" -> "readiness / liveness probes"
          ~ uid     = "ca866f47-2789-471f-ae87-72a3e701b68a" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/ca866f47-2789-471f-ae87-72a3e701b68a/readiness-liveness-probes-in-namespace" -> (known after apply)
          ~ version = 1 -> (known after apply)
        },
      ~ {
          ~ title   = "readiness / liveness probes" -> "Node Condition"
          ~ uid     = "ad9f701f-2796-43d2-bbf9-5ff1002118e9" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/ad9f701f-2796-43d2-bbf9-5ff1002118e9/readiness-liveness-probes" -> (known after apply)
          ~ version = 1 -> (known after apply)
        },
      ~ {
          ~ title   = "Node Condition" -> "Node Sockets Used"
          ~ uid     = "KbpocXAVk" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/KbpocXAVk/node-condition" -> (known after apply)
          ~ version = 1 -> (known after apply)
        },
      ~ {
          ~ title   = "Node Sockets Used" -> "Priority class"
          ~ uid     = "GGodmXAVz" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/GGodmXAVz/node-sockets-used" -> (known after apply)
          ~ version = 1 -> (known after apply)
        },
      ~ {
          ~ title   = "Priority class" -> "Prometheus Blackbox Exporter"
          ~ uid     = "W8nct6zGz" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/W8nct6zGz/priority-class" -> (known after apply)
          ~ version = 2 -> (known after apply)
        },
      ~ {
          ~ title   = "Prometheus Blackbox Exporter" -> "Selfservice -- Tagging Adoption"
          ~ uid     = "bXDq_ZNnz" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/bXDq_ZNnz/prometheus-blackbox-exporter" -> (known after apply)
          ~ version = 1 -> (known after apply)
        },
      ~ {
          ~ title   = "Selfservice -- Tagging Adoption" -> "SelfService -- RDS Tagging Compliance"
          ~ uid     = "c9f3f4c0-454f-49df-90e3-93a13d25ce4b" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/c9f3f4c0-454f-49df-90e3-93a13d25ce4b/selfservice-tagging-adoption" -> (known after apply)
          ~ version = 1 -> (known after apply)
        },
      ~ {
          ~ title   = "SelfService -- RDS Tagging Compliance" -> "Traefik - Blue/Green Deployment"
          ~ uid     = "d032a367-82af-425a-8d05-c1e5395aeee3" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/d032a367-82af-425a-8d05-c1e5395aeee3/selfservice-rds-tagging-compliance" -> (known after apply)
          ~ version = 1 -> (known after apply)
        },
      ~ {
          ~ title   = "Traefik - Blue/Green Deployment" -> "Traefik"
          ~ uid     = "jGlZuY0Vk" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/jGlZuY0Vk/traefik-blue-green-deployment" -> (known after apply)
          ~ version = 1 -> (known after apply)
        },
      ~ {
          ~ title   = "Traefik" -> "Kubernetes/Tanzu/Velero"
          ~ uid     = "qPdAviJmz" -> (known after apply)
          ~ url     = "https://platform.grafana.dfds.cloud/d/qPdAviJmz/traefik" -> (known after apply)
          ~ version = 1 -> (known after apply)
        },
      - {
          - title   = "Kubernetes/Tanzu/Velero"
          - uid     = "YAniUGC"
          - url     = "https://platform.grafana.dfds.cloud/d/YAniUGC/kubernetes-tanzu-velero"
          - version = 1
        },
    ]

time=2024-08-16T11:02:27Z level=info msg=Downloading Terraform configurations from file:///atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-platform-ws-01 into /atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-platform-ws-01/environments/platform/.terragrunt-cache/U54ShdOYLL9xW6-tvbqfARbsodE/9BMdIpBe-O6Z80jvzminapAjLXM
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d environments/platform -w grafana-cloud-objects-platform-ws-01
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.hellman.oxygen.dfds.cloud/lock?id=dfds%252Fgrafana-cloud-objects%252Fenvironments%252Fplatform%252Fgrafana-cloud-objects-platform-ws-01)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d environments/platform -w grafana-cloud-objects-platform-ws-01
  ```
Plan: 98 to add, 0 to change, 100 to destroy.

---
### Plan Summary

3 projects, 2 with changes, 0 with no changes, 1 failed